rottenpotatoes/app/controllers/movies_controller.rb

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "movies" SET "rating" = ?, "release_date" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["rating", "G"], ["release_date", "2015-11-27 00:00:00.000000"], ["updated_at", "2015-11-27 20:57:08.793934"], ["id", 3]]

  def find_same_director_movies
    @movie = Movie.find(params[:id])
    #byebug
    unless ( @movie.director.nil? || @movie.director.empty? )
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "movies".* FROM "movies" WHERE "movies"."director" = ? LIMIT 1  [["director", "George Lucas"]]
SELECT COUNT(*) FROM "movies" WHERE (title = 'Alien')